/* eslint-disable no-misleading-character-class */
const alphaDots = {
  en: /^[0-9A-Z.-]*$/i,
  cs: /^[0-9A-ZÁČĎÉĚÍŇÓŘŠŤÚŮÝŽ.-]*$/i,
  da: /^[0-9A-ZÆØÅ.-]*$/i,
  de: /^[0-9A-ZÄÖÜß.-]*$/i,
  es: /^[0-9A-ZÁÉÍÑÓÚÜ.-]*$/i,
  fa: /^[ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰپژگچکی]*$/,
  fr: /^[0-9A-ZÀÂÆÇÉÈÊËÏÎÔŒÙÛÜŸ.-]*$/i,
  it: /^[0-9A-Z\xC0-\xFF.-]*$/i,
  lt: /^[0-9A-ZĄČĘĖĮŠŲŪŽ.-]*$/i,
  nl: /^[0-9A-ZÉËÏÓÖÜ.-]*$/i,
  hu: /^[0-9A-ZÁÉÍÓÖŐÚÜŰ.-]*$/i,
  pl: /^[0-9A-ZĄĆĘŚŁŃÓŻŹ.-]*$/i,
  pt: /^[0-9A-ZÃÁÀÂÇÉÊÍÕÓÔÚÜ.-]*$/i,
  ro: /^[0-9A-ZĂÂÎŞŢ.-]*$/i,
  ru: /^[0-9А-ЯЁ.-]*$/i,
  sk: /^[0-9A-ZÁÄČĎÉÍĹĽŇÓŔŠŤÚÝŽ.-]*$/i,
  sr: /^[0-9A-ZČĆŽŠĐ.-]*$/i,
  sv: /^[0-9A-ZÅÄÖ.-]*$/i,
  tr: /^[0-9A-ZÇĞİıÖŞÜ.-]*$/i,
  uk: /^[0-9А-ЩЬЮЯЄІЇҐ.-]*$/i,
  ar: /^[٠١٢٣٤٥٦٧٨٩0-9ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىيًٌٍَُِّْٰ.-]*$/,
  az: /^[0-9A-ZÇƏĞİıÖŞÜ.-]*$/i,
  el: /^[0-9Α-ώ.-]*$/i,
}

export default alphaDots
